2.
alert(null || 2 || undefined); // 2 - повертає true
alert(alert(213) || 2 || alert(324)); // 213, 2  - спочатку виведе перший алерт, а потім вибере перше true
alert(13123 && null && 2); // null - вертає false
alert(alert(1) && alert(2)); // 1, undefined - виводить перший алерт і тоді прирівнює 2-ге значення з undefined
alert(null || 2 && 2 || 4); // 2 - вибере cеред першої пари 2, потім серед 2-ї пари також 2 і потім вибиратиме 2 && 2

if(-1 || 0) alert("first");
if (-1 && 0) alert("second"); //first : -1 і 0 в другому значення не може виконатися - верне false, тому що тип 0===false

3.
"" + 123 + 0// 1230 - приведе все до строки
"" - 143 + 0// -1430 - аналогічно
true + false// 1 - (1+0=1)
6 / "3"//2 - приведе 2-ге значення до числа
//"4pt" - 4pt//не запустить скрипт, так як 2-га змінна неправильно записана(не відноситься ні до числа, ні до строки)
5 && 213//213 - вибере 2-ге значення, так як при "&&(і)" вибирає завжди наступне.
5 || 0 //5 - верне true
null + 123//null - відсутність значення
undefined + 10//undefined - невизначене значення так як перше undefined

4.
var name = "Andrii"
function myName(name) {
    alert (name);
}
myName();
myName("Ivan");
//undefined - та як не вказане значення функції, а потім видасть Ivan, так як задане значення "Ivan"